[
    {
        "id": "9d5f15c9e6803ea9c8465087d693903b42c6a4e0f3fb7e58556545a43e56574d",
        "text": "Calendar 2024/2025\nDates are subject to change.\nFALL SEMESTER 2024\nClasses begin. Wednesday 21 August\nRegistration ends. Friday 30 August.\nDeadline to pay fall charges. Saturday 31 August.\nThanksgiving holidays. Saturday 23 November - Sunday 1 December\nClasses end. Thursday 5 December\nReading days and examinations. Friday 6 December - Saturday 14 December\nFall semester ends. Saturday 14 December\nSPRING SEMESTER 2025\nDeadline to pay spring charges. Tuesday 31 December 2024\nClasses begin. Monday 6 January\nRegistration ends. Tuesday 14 January\nSpring holidays. Saturday 8 March - Sunday 16 March\nClasses end. Monday 21 April\nReading days and examinations. Tuesday 22 April - Thursday 1 May\nCommencement. Friday 9 May\nMAYMESTER 2025\nClasses begin. Monday 5 May\nClasses end; examinations. Friday 30 May\nSUMMER SESSION 2025\nClasses begin. Tuesday 3 June\nExaminations for first-half courses. Friday 4 July\nSecond-half courses begin. Tuesday 8 July\nExaminations for second-half and full-term summer courses. Friday 8 August\nSpecial Programs for Undergraduates\nPage 18 of 1019",
        "metadata": {
            "source": "catalog",
            "page_number": 17,
            "chunk_number": 2,
            "section": [
                "Calendar 2024/2025"
            ],
            "last_selected_index": 2
        }
    },
    {
        "id": "126f4fa6678d6b9190d2bfd4a98c4d0b7bcaf55b6fc43300586830b7645a7141",
        "text": "Immersion Vanderbilt\nImmersion Vanderbilt is an innovative program that enhances the undergraduate experience through hands-on\nexperiential and applied learning. Each student shall complete at least one immersive experience, followed by a\nculminating project. At its core, Immersion Vanderbilt gives every Vanderbilt student the opportunity to pursue\nintellectual curiosities through immersive experiences and culminating projects that are as creative and unique as\nthe students. Throughout the Immersion Vanderbilt program, students are supported by faculty and the Immersion\nVanderbilt office.\nImmersion Vanderbilt is a requirement for all undergraduates. Some majors, minors, programs of study, and classes\nare approved to satisfy the immersive experience, culminating project, or both. To complete the Immersion\nVanderbilt requirement, students engage in one or more experiential learning activities, for which the student has a\nfaculty or staff mentor. The student will complete their immersive experience in one of the six immersion pathways\nof their choosing: 1) Research; 2) Study Abroad; 3) Innovation, Arts, & Design; 4) Civic & Community Engagement;\n5) Leadership & Professional Development; or 6) Internships. When a student engages in research for Immersion, a\nVanderbilt faculty member must be the mentor. Throughout the program, students are prompted to reflect upon\ntheir immersive experiences, which can inform the development of the culminating project. This reflective process",
        "metadata": {
            "source": "catalog",
            "page_number": 19,
            "chunk_number": 1,
            "section": [
                "Special Programs for Undergraduates, Immersion Vanderbilt"
            ],
            "last_selected_index": 8
        }
    },
    {
        "id": "9a9c50568eee467453e00509e31e5f3577402d255dd7de60aecfe6bddbacbe38",
        "text": "Vanderbilt faculty member must be the mentor. Throughout the program, students are prompted to reflect upon\ntheir immersive experiences, which can inform the development of the culminating project. This reflective process\nensures that students gain a deeper understanding of their immersive experience(s) and its significance to their\ngoals.\nUpon completing their immersive experience(s), students plan and complete their culminating project. Although\nstudents are encouraged to base their culminating project on their immersive experience(s), this is not required; the\nculminating project can relate to an immersive experience already completed or a new topic. As with the immersive\nexperience, the student completes their culminating project in one of the six immersion pathways: 1) Research; 2)\nStudy Abroad; 3) Innovation, Arts, & Design; 4) Civic & Community Engagement; 5) Leadership & Professional\nDevelopment; or 6) Internship. The format of the culminating project can take many forms, including oral\npresentations, poster presentations, artistic displays at a showcase, performances, design projects, videos,\nwebsites, prototypes, white papers, or senior theses, among others. The Immersion Vanderbilt faculty adviser\nguides the creation of the culminating project, assesses its quality, and marks it as complete.\nWhen the Immersion Vanderbilt faculty adviser approves the culminating project submission, the Immersion",
        "metadata": {
            "source": "catalog",
            "page_number": 19,
            "chunk_number": 2,
            "section": [
                "Special Programs for Undergraduates, Immersion Vanderbilt"
            ],
            "last_selected_index": 8
        }
    }
]